<a href="https://colab.research.google.com/github/hdpark1208/StudyCode/blob/main/%EC%9E%90%EB%A3%8C%EA%B5%AC%EC%A1%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

#데이터프레임

##데이터프레임 기본 활용

*  데이터프레임 만들기

In [ ]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [ ]:
df = pd.DataFrame(dict_data)

In [ ]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

* 인덱스 / 열 이름 설정

In [ ]:
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],index=['준서','예은'],columns=['나이','성별','학교'])

In [ ]:
df.index

Index(['준서', '예은'], dtype='object')

In [ ]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

In [ ]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [ ]:
df.index=['학생1','학생2']    #인덱스 변경
df.columns=['연령','남녀','소속']    #열 이름 변경

In [ ]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [ ]:
df.rename(index={'학생1':'준서','학생2':'예은'}, columns={'연령':'춘추','남녀':'Sex','소속':'학교이름'},inplace=True)    #다른 방식을 이용하여 바꾸기
df

    춘추 Sex 학교이름
준서  15   남  덕영중
예은  17   여  수리중

* 행 / 열 삭제

In [ ]:
exam_data = {'수학':[90,80,70],'영어':[98,89,95],'음악':[50,20,50],'체육':[40,50,60]}

In [ ]:
df = pd.DataFrame(exam_data, index=['학생1','학생2','학생3'])
df

     수학  영어  음악  체육
학생1  90  98  50  40
학생2  80  89  20  50
학생3  70  95  50  60

In [ ]:
df2 = df[:]    #복사
print(type(df2))
df2

<class 'pandas.core.frame.DataFrame'>

     수학  영어  음악  체육
학생1  90  98  50  40
학생2  80  89  20  50
학생3  70  95  50  60

In [ ]:
df2.drop('학생1')

     수학  영어  음악  체육
학생2  80  89  20  50
학생3  70  95  50  60

In [ ]:
df2.drop(['학생1','학생3'])

     수학  영어  음악  체육
학생2  80  89  20  50

In [ ]:
df2.drop(['음악','체육'],axis=1)

     수학  영어
학생1  90  98
학생2  80  89
학생3  70  95

* 행 / 열 선택, 슬라이싱

In [ ]:
df

     수학  영어  음악  체육
학생1  90  98  50  40
학생2  80  89  20  50
학생3  70  95  50  60

In [ ]:
df.loc[['학생1','학생2']]

     수학  영어  음악  체육
학생1  90  98  50  40
학생2  80  89  20  50

In [ ]:
df.loc['학생1',['수학','영어']]

수학    90
영어    98
Name: 학생1, dtype: int64

In [ ]:
df.iloc[0:2,0:3]

     수학  영어  음악
학생1  90  98  50
학생2  80  89  20

In [ ]:
df.iloc[:,::2]

     수학  음악
학생1  90  50
학생2  80  20
학생3  70  50

* 행 / 열 추가

In [ ]:
df

     수학  영어  음악  체육
학생1  90  98  50  40
학생2  80  89  20  50
학생3  70  95  50  60

In [ ]:
df['국어'] = 80    #열 추가
df

     수학  영어  음악  체육  국어
학생1  90  98  50  40  80
학생2  80  89  20  50  80
학생3  70  95  50  60  80

In [ ]:
df.loc['학생4']=[10,20,30,40,50]
df

     수학  영어  음악  체육  국어
학생1  90  98  50  40  80
학생2  80  89  20  50  80
학생3  70  95  50  60  80
학생4  10  20  30  40  50

In [ ]:
df.loc[:,'컴퓨터'] = [50,60,70,80]
df

     수학  영어  음악  체육  국어  컴퓨터
학생1  90  98  50  40  80   50
학생2  80  89  20  50  80   60
학생3  70  95  50  60  80   70
학생4  10  20  30  40  50   80

In [ ]:
df.loc['학생3','컴퓨터'] = 100
df

     수학  영어  음악  체육  국어  컴퓨터
학생1  90  98  50  40  80   50
학생2  80  89  20  50  80   60
학생3  70  95  50  60  80  100
학생4  10  20  30  40  50   80

In [ ]:
#df.iloc[:,'사회']=100    iloc 로는 새로운 행,열 을 만들 수 없나?

* 행 / 열 위치 변경

In [ ]:
df

     수학  영어  음악  체육  국어  컴퓨터
학생1  90  98  50  40  80   50
학생2  80  89  20  50  80   60
학생3  70  95  50  60  80  100
학생4  10  20  30  40  50   80

In [ ]:
df.transpose()

     학생1  학생2  학생3  학생4
수학    90   80   70   10
영어    98   89   95   20
음악    50   20   50   30
체육    40   50   60   40
국어    80   80   80   50
컴퓨터   50   60  100   80

In [ ]:
df.T

     학생1  학생2  학생3  학생4
수학    90   80   70   10
영어    98   89   95   20
음악    50   20   50   30
체육    40   50   60   40
국어    80   80   80   50
컴퓨터   50   60  100   80

In [ ]:
df

     수학  영어  음악  체육  국어  컴퓨터
학생1  90  98  50  40  80   50
학생2  80  89  20  50  80   60
학생3  70  95  50  60  80  100
학생4  10  20  30  40  50   80

* 특정 열을 행 인덱스로 설정 (길이가 항상 같으니 대체 될 수 있다)

In [ ]:
df

     수학  영어  음악  체육  국어  컴퓨터
학생1  90  98  50  40  80   50
학생2  80  89  20  50  80   60
학생3  70  95  50  60  80  100
학생4  10  20  30  40  50   80

In [ ]:
df.loc[:,'이름'] = ['철수','영희','훈이','짱구']
df

     수학  영어  음악  체육  국어  컴퓨터  이름
학생1  90  98  50  40  80   50  철수
학생2  80  89  20  50  80   60  영희
학생3  70  95  50  60  80  100  훈이
학생4  10  20  30  40  50   80  짱구

In [ ]:
df.set_index('이름')    #기존의 행 인덱스는 삭제된다

    수학  영어  음악  체육  국어  컴퓨터
이름
철수  90  98  50  40  80   50
영희  80  89  20  50  80   60
훈이  70  95  50  60  80  100
짱구  10  20  30  40  50   80

In [ ]:
df.reset_index()    #인덱스 정수형으로 초기화 , 기존 행 인덱스가 열로 이동한다

  index  수학  영어  음악  체육  국어  컴퓨터  이름
0   학생1  90  98  50  40  80   50  철수
1   학생2  80  89  20  50  80   60  영희
2   학생3  70  95  50  60  80  100  훈이
3   학생4  10  20  30  40  50   80  짱구

* 행 인덱스를 기준으로 데이터프레임 정렬

In [ ]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [ ]:
df.sort_index()

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [ ]:
df.sort_index(ascending=False)

   c0  c1  c2  c3  c4
2   3   6   9  12  15
1   2   5   8  11  14
0   1   4   7  10  13

* 열 인덱스를 기준으로 데이터프레임 정렬

In [ ]:
df.sort_values(by='c1')

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [ ]:
df.sort_values(by='c2',ascending=False)

   c0  c1  c2  c3  c4
2   3   6   9  12  15
1   2   5   8  11  14
0   1   4   7  10  13

##연산

###시리즈 연산

In [ ]:
dict_data = {'국어':100,'영어':80,'수학':90}    #시리즈와 스칼라 연산
student1 = pd.Series(dict_data)
student1
percentage = student1 / 100    
percentage

국어    1.0
영어    0.8
수학    0.9
dtype: float64

In [ ]:
dict_data1 = {'국어':100,'영어':80,'수학':90}    #시리즈와 시리즈 연산
dict_data2 = {'국어':70,'수학':50,'영어':100}
student1 = pd.Series(dict_data1)
student2 = pd.Series(dict_data2)
add = student1 + student2
mul =student1*student2
print(add,"\n",mul)

국어    170
수학    140
영어    180
dtype: int64
 국어    7000
수학    4500
영어    8000
dtype: int64

In [ ]:
dict_data1 = {'국어':100,'영어':80,'수학':90,'과학':40}    #시리즈와 시리즈 연산_2
dict_data2 = {'국어':70,'수학':50,'영어':100,'사회':45}
student1 = pd.Series(dict_data1)
student2 = pd.Series(dict_data2)
add = student1 + student2
mul =student1*student2
print(add,"\n",mul)

과학      NaN
국어    170.0
사회      NaN
수학    140.0
영어    180.0
dtype: float64
 과학       NaN
국어    7000.0
사회       NaN
수학    4500.0
영어    8000.0
dtype: float64

In [ ]:
sr_add = student1.add(student2,fill_value=0)    #시리즈 연산 메소드
sr_mul = student1.mul(student2,fill_value=1)
result = pd.DataFrame([sr_add,sr_mul],index=['덧셈','곱셈'])
result

      과학      국어    사회      수학      영어
덧셈  40.0   170.0  45.0   140.0   180.0
곱셈  40.0  7000.0  45.0  4500.0  8000.0

###데이터프레임 연산

In [ ]:
import seaborn as sns

In [ ]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
print(type(titanic))
print(type(df))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [ ]:
df.head(7)

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625

In [ ]:
df1 = df - 10
df1.head(7)

    age     fare
0  12.0  -2.7500
1  28.0  61.2833
2  16.0  -2.0750
3  25.0  43.1000
4  25.0  -1.9500
5   NaN  -1.5417
6  44.0  41.8625

In [ ]:
(df-df1).head(7)

    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0
3  10.0  10.0
4  10.0  10.0
5   NaN  10.0
6  10.0  10.0